Tekla Open API Reference for Tekla Structures 2025
Load.PartNames Property
 The part names.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Load.LoadPartNamesEnum PartNames { get; set; }
Public Property PartNames As Load.LoadPartNamesEnum
	Get
	Set
Property Value
Type: Load.LoadPartNamesEnum
See Also
Reference
Load Class
Tekla.Structures.Model Namespace